Repository: Fatih20/gnonograms
Catalog: po/extra/*.po
Languages: fr

source: Create and solve nonogram puzzles.
fr: Créez et résolvez des puzzles gnonogram.

source: game;puzzle;logic;nonograms;Tsunami;Picross;Griddlers;Japanese Crossword;
fr: jeu;puzzle;logique:nonograms;Tsunami;Picross;Griddlers;Mots Croisés japonais;

source: Logic Game
fr: Jeu de logique

source: About Gnonograms
fr: À propos de Gnonograms

source: Create and solve gnonogram puzzles
fr: Créez et résolvez des puzzles gnonogram

source: Draw puzzles
fr: Dessinez des puzzles

source: Generate random puzzles of chosen difficulty
fr: Générez des puzzles aléatoirement en fonction de la difficulté choisie

source: Prepare for Juno
fr: Préparation pour Juno

source: Use Houston CI for testing
fr: Utilisation de Houston CI pour les tests

source: Use separate packaging branch
fr: Utilisation d'une branche séparée pour les paquets

source: Add content rating tags
fr: Ajout des balises d'évaluation de contenu

source: Use scrolled window when grid larger than screen
fr: Utilisation de défilement de la fenêtre quand la grille est plus grande que l'écran

source: Fix some bugs with clue label formating
fr: Correction de certains bugs avec le format du texte d'indice

source: Toast has own copy of message to avoid possible crash
fr: Les messages volants ont désormais leur propre copie des messages pour éviter un possible plantage

source: Conditional compilation with Gtk version &gt;=3.22
fr: Compilation conditionnelle avec les version de Gtk &gt;=3.22

source: Some code refactoring and cleanup
fr: Réarrangement et nettoyage du code

source: Various small bug fixes
fr: Petites corrections de bugs diverses

source: Fix crash when dragging across grid edge
fr: Correction d'un plnatage lors du glisser déposer vers la bordure de la grille

source: Clear puzzle name when resized
fr: Effacement du nom du puzzle au redimensionnement

source: Hint button
fr: Bouton d'indice

source: Strikethrough completed blocks in clue label (with option to disable)
fr: Texte des blocs complétés barrés dans le texte d'indice (avec une option pour le désactiver)

source: Clue label turns red if completed incorrectly (with option to disable)
fr: Le texte d'indice devient rouge si la grille n'est pas complétée correctement (avec une option pour le désactiver)

source: Additional shortcuts
fr: Raccourcis supplémentaires

source: Various bug fixes
fr: Diverses corrections de bugs

source: Save and restore move history
fr: Enregistrement et restauration de l'historique des mouvements

source: Fade completed clues when solving
fr: Affichage des indices complétés lors de la résolution

source: Generate difficult puzzles faster
fr: Générez des puzzles difficiles plus rapidement

source: Add redo button
fr: Ajout d'un bouton refaire

source: Reorder header bar
fr: Réorganisation de la barre d'en-tête

source: Some restyling
fr: Un peu de reconception

source: Add brand styling and update screenshots
fr: Ajout d'une toute nouvelle apparence et mise à jour des captures d'écran

source: Fix possible failed assertion in advanced solver
fr: Correction d'une possible erreur dans le résolveur avancé

source: Fix some resizing isses
fr: Correction de certains problèlmes de redimensionnement

source: Fix some loading and saving issues
fr: Correction de certains problèmes de chargement et de sauvegarde

source: Fix regression in game generator
fr: Correction des régressions dans le générateur de jeu

source: Fix error in solver
fr: Correction d'un erreur dans le résolveur

source: Fix post_install.py script
fr: Correction du script post_install.py

source: Remove unused or deprecated config variables
fr: Suppression des variables de configuration inutilisées ou dépréciées

source: Replace deprecated Gtk.Stock items
fr: Remplacement des éléments Gtk.Stock dépréciés

source: Fix first run after clean install problems
fr: Correction du premier démarrage après des problèmes de nettoyage de l'installation

source: More complete uninstall
fr: Désinstallation plus complète

source: Provide mimeinfo and icon
fr: Fourniture des informations de type MIME et d'icône

source: Fix debian files
fr: Correction des fichiers debian

source: Fix .desktop file
fr: Correction du fichier .desktop

source: Fix .appdata file
fr: Correction du fichier .appdata

source: Builds with dpkg-buildpackage and Travis CI
fr: Compilation avec dpkg-buildpackage et Travis CI

source: Correct dependencies for xenial build
fr: Correction des dépendances pour la compilation avec xenial

source: Initial release.
fr: Version initiale.

source: Generate random puzzles
fr: Générez des puzzles aléatoirement

source: Check for errors while solving
fr: Vérifiez s'il y a des erreurs pendant la résolution

source: Adjust size of grid
fr: Ajustez la taille de la grille

source: Adjust difficulty of generated puzzles
fr: Ajustez la difficulté des puzzles générés

source: Save and restore program state and settings
fr: Enregistrement et restauration de l'état du programme et des paramètres
