Repository: Fatih20/gnonograms
Catalog: po/*.po
Languages: fr

source: Enter title of game here
fr: Entrez le titre de la partie ici

source: Title
fr: Titre

source: Freedom = %u
fr: Liberté = %u

source: Open
fr: Ouvrir

source: Save
fr: Enregistrer

source: Apply
fr: Appliquer

source: Save solution too
fr: Enregistre aussi la solution

source: Overwrite %s
fr: Écraser %s

source: This action will destroy contents of that file
fr: Cette action va détruire le contenu du fichier

source: Gnonogram puzzles
fr: Puzzles Gnonogram

source: Choose a puzzle
fr: Choisir un puzzle

source: Missing clues
fr: Indices manquants

source: Invalid clue
fr: Indices invalides

source: Solution grid or working grid missing
fr: Grille de solution ou grille de jeu manquante

source: Wrong number of rows in solution or working grid
fr: Nombre de lignes erroné dans la grille de solution ou de jeu

source: Wrong number of columns in solution or working grid
fr: Nombre de colonnes erroné dans la grille de solution ou de jeu

source: Invalid cell state
fr: État de cellule invalide

source: Name and save this puzzle
fr: Nommez et enregistrez ce puzzle

source: Do not save computer insoluble clues without solution
fr: Ne pas enregistrer les indices insolubles dans l'ordinateur.

source: Trivial
fr: Simple

source: Very Easy
fr: Très facile

source: Easy
fr: Facile

source: Moderately difficult
fr: Moyen

source: Difficult
fr: Difficile

source: Very Difficult
fr: Très difficile

source: Advanced logic required
fr: Logique avancée requise

source: Possibly ambiguous
fr: Possiblement ambigü

source: Super human
fr: Surhumain

source: Undefined
fr: Indéfini

source: Untitled
fr: Sans titre

source: Random pattern
fr: Motif aléatoire

source: Game generation was cancelled
fr: La génération du jeu à été annulée

source: Failed to generate game of required grade
fr: Échec de la génération du jeu ou de la difficulté requise

source: Unable to save %s
fr: Impossible d'enregistrer %s

source: game
fr: partie

source: Unable to load game. %s
fr: Impossible de charger la partie. %s

source: Dimensions too large
fr: Dimensions trop grandes

source: Dimensions too small
fr: Dimensions trop petites

source: Dimensions missing
fr: Dimensions manquantes

source: Clues missing
fr: Indices manquants

source: %u error found
fr: %u erreur trouvée

source: %u errors found
fr: %u erreurs trouvées

source: Correct solution
fr: Corriger la solution

source: There are errors
fr: Il y a des erreurs

source: Saved to %s
fr: Enregistré dans %s

source: Failed to find a hint using simple logic - multi-line logic (trial and error) required
fr: Impossible de trouver un indice à l'aide de la logique simple - logique multi-lignes (essai et erreur) nécessaire

source: Solving was cancelled
fr: La résolution à été annulée

source: Gnonograms for Elementary
fr: Gnonograms pour elementary

source: Load a Game from File
fr: Charger une partie depuis un fichier

source: Undo Last Move
fr: Annuler le dernier mouvement

source: Redo Last Move
fr: Rétablir le dernier mouvement

source: Go Back to Last Correct Position
fr: Retourner à la dernière position correcte

source: Suggest next move
fr: Suggérer le mouvement suivant

source: Solve by Computer
fr: Résoudre par l'ordinateur

source: Drawing %s
fr: Dessin de %s

source: Read Only - Save to a different file
fr: Lecture seule - Enregistrez dans un fichier différent

source: Save will Overwrite
fr: L'enregstrement va écraser

source: Restart solving
fr: Recommencer la résolution

source: No errors
fr: Pas d'erreurs

source: Rows
fr: Lignes

source: Columns
fr: Colonnes

source: Strike out complete blocks
fr: Rayer les blocs complets

source: Cancel solving
fr: Annuler la résolution
